In [1]:
import numpy as np
import pandas as pd

In [5]:
sozluk1 = {"Isim":["Ahmet","Mehmet","Zeynep", "Atil"],
          "Spor":["Kosu","Yüzme","Kosu","Basketbol"],
          "Kalori":[100,200,300,400]
          }
dataframe1 = pd.DataFrame(sozluk1,index=[0,1,2,3])

In [6]:
sozluk2 = {"Isim":["Osman","Levent","Atlas", "Fatma"],
          "Spor":["Kosu","Yüzme","Kosu","Basketbol"],
          "Kalori":[200,100,50,300]
          }
dataframe2 = pd.DataFrame(sozluk2,index=[4,5,6,7])

In [7]:
sozluk3 = {"Isim":["Ayse","Mahmut","Duygu", "Nur"],
          "Spor":["Kosu","Yüzme","Badminton","Tenis"],
          "Kalori":[300,400,500,250]
          }
dataframe3 = pd.DataFrame(sozluk3,index=[8,9,10,11])

In [8]:
dataframe1

     Isim       Spor  Kalori
0   Ahmet       Kosu     100
1  Mehmet      Yüzme     200
2  Zeynep       Kosu     300
3    Atil  Basketbol     400

In [9]:
dataframe2

     Isim       Spor  Kalori
4   Osman       Kosu     200
5  Levent      Yüzme     100
6   Atlas       Kosu      50
7   Fatma  Basketbol     300

In [10]:
dataframe3

      Isim       Spor  Kalori
8     Ayse       Kosu     300
9   Mahmut      Yüzme     400
10   Duygu  Badminton     500
11     Nur      Tenis     250

## concatenation

In [12]:
pd.concat([dataframe1,dataframe2,dataframe3],axis=0)

      Isim       Spor  Kalori
0    Ahmet       Kosu     100
1   Mehmet      Yüzme     200
2   Zeynep       Kosu     300
3     Atil  Basketbol     400
4    Osman       Kosu     200
5   Levent      Yüzme     100
6    Atlas       Kosu      50
7    Fatma  Basketbol     300
8     Ayse       Kosu     300
9   Mahmut      Yüzme     400
10   Duygu  Badminton     500
11     Nur      Tenis     250

## merge

In [13]:
mergeSozluk1={"Isim":["Ahmet","Mehmet","Zeynep","Atil"],
             "Spor":["Kosu","Yüzme","Kosu","Basketbol"]
             }
mergeDataFrame1 = pd.DataFrame(mergeSozluk1)

In [14]:
mergeDataFrame1

     Isim       Spor
0   Ahmet       Kosu
1  Mehmet      Yüzme
2  Zeynep       Kosu
3    Atil  Basketbol

In [15]:
mergeSozluk2={"Isim":["Ahmet","Mehmet","Zeynep","Atil"],
             "Kalori":[100,200,150,250]
             }
mergeDataFrame2 = pd.DataFrame(mergeSozluk2)

In [16]:
mergeDataFrame2

     Isim  Kalori
0   Ahmet     100
1  Mehmet     200
2  Zeynep     150
3    Atil     250

In [17]:
pd.merge(mergeDataFrame1,mergeDataFrame2,on="Isim")

     Isim       Spor  Kalori
0   Ahmet       Kosu     100
1  Mehmet      Yüzme     200
2  Zeynep       Kosu     150
3    Atil  Basketbol     250

In [18]:
maasSozluk={"Isim":["Atil","Zeynep","Mehmet","Ahmet"],
           "Departman":["Yazilim","Satis","Pazarlama","Yazilim"],
            "Maas": [200,300,400,500]
           }
maasDataFrame = pd.DataFrame(maasSozluk)

In [19]:
maasDataFrame

     Isim  Departman  Maas
0    Atil    Yazilim   200
1  Zeynep      Satis   300
2  Mehmet  Pazarlama   400
3   Ahmet    Yazilim   500

In [21]:
maasDataFrame["Departman"].unique()

array(['Yazilim', 'Satis', 'Pazarlama'], dtype=object)

In [23]:
maasDataFrame["Departman"].nunique()
#Number Of Unique

3

In [24]:
maasDataFrame["Departman"].value_counts()

Yazilim      2
Satis        1
Pazarlama    1
Name: Departman, dtype: int64

In [30]:
def bruttenNete(maas):
    return maas * 0.66

In [31]:
maasDataFrame["Maas"].apply(bruttenNete)

0    132.0
1    198.0
2    264.0
3    330.0
Name: Maas, dtype: float64

In [33]:
maasDataFrame.isnull()

    Isim  Departman   Maas
0  False      False  False
1  False      False  False
2  False      False  False
3  False      False  False

## pivot_table

In [35]:
yeniBirVeri = {"Karakter Sinifi":["South Park","South Park","Simpson","Simpson"],
              "Karakter Ismi": ["Cartman","Kenny","Homer","Bart"],
               "Karakter Yas":[9,10,50,20]
              }
karakterDF=pd.DataFrame(yeniBirVeri)

In [36]:
karakterDF

  Karakter Sinifi Karakter Ismi  Karakter Yas
0      South Park       Cartman             9
1      South Park         Kenny            10
2         Simpson         Homer            50
3         Simpson          Bart            20

In [40]:
karakterDF.pivot_table(values="Karakter Yas",index=["Karakter Sinifi","Karakter Ismi"])

                               Karakter Yas
Karakter Sinifi Karakter Ismi
Simpson         Bart                     20
                Homer                    50
South Park      Cartman                   9
                Kenny                    10